/***   作業 1 填答區開始   **/



/***   作業 1 填答區結束   **/

/***   作業 2 填答區開始   **/



/***   作業 2 填答區結束   **/

/***   作業 3 填答區開始   **/



/***   作業 3 填答區結束   **/

/***   作業 4 填答區開始   **/



/***   作業 4 填答區結束   **/



/***   作業 5 填答區開始   **/



/***   作業 5 填答區結束   **/



/***   作業 6 填答區開始   **/



/***   作業 6 填答區結束   **/

/***   作業 7 填答區開始   **/
//此題目不用在 codepen 上作答，請同學用小畫家製作記憶體指向圖片，並藉由程式勇者村系統的任務留言介面上傳您的答案圖片即可


/***   作業 7 填答區結束   **/

/***   作業 8 填答區開始   **/



/***   作業 8 填答區結束   **/


/***   作業 9 填答區開始   **/



/***   作業 9 填答區結束   **/

/***   作業 10 填答區開始   **/



/***   作業 10 填答區結束   **/